# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 45  # number of classes
scales:
  # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  #n: [0.33, 0.25, 1024]
  #s: [0.33, 0.50, 1024]
  #m: [0.67, 0.75, 768]
  #l: [1.00, 1.00, 512]
  #x: [1.00, 1.25, 512]
  l: [1, 1, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2         320*320
  - [-1, 1, Conv, [192, 3, 2]]  # 1-P2/4        160*160
  - [-1, 3, C2f_OD, [192, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8        80*80
  - [-1, 6, C2f_OD, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16       40*40
  - [-1, 6, C2f_OD, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32      20*20
  - [-1, 3, C2f_OD, [1024, True]] # 8
# YOLOv8.0 head
head:
  - [[2, 4, 6, 8], 1, SimFusion_4in, []]
  - [-1, 1, IFM, [[256, 512]]] #10

  - [[2, 4, 6], 1, SimFusion_3in, [256]]
  - [[-1, 10], 1, InjectionMultiSum_Auto_pool, [256, [256, 512], 0]]
  - [-1, 3, C2f_OD, [256, False]] #13

  - [[4, 6, 8], 1, SimFusion_3in, [512]]
  - [[-1, 10], 1, InjectionMultiSum_Auto_pool, [512, [256, 512], 1]]
  - [-1, 3, C2f_OD, [512, False]] #16

  - [[16, 13, 8], 1, PyramidPoolAgg, [704]]
  - [-1, 1, local_attention, [704]] #18

  - [[4, 2], 1, AdvPoolFusion, []] # cat backbone P2
  - [[-1, 18], 1, InjectionMultiSum_Auto_pool, [192, [192, 512], 0]]
  - [-1, 3, C2f_OD, [192, False]]  # 21 (P2 -xsmall)

  - [[16, 18], 1, InjectionMultiSum_Auto_pool, [512, [192, 512], 1]]
  - [-1, 3, C2f_OD, [512, False]]  # 23 (P4 -medium)

  - [[21, 23, 8], 1, Detect, [nc]]  # Detect(P2, P4, P5)
